In [3]:
import mysql.connector

In [4]:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "123456789"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000016DBA2A9450>

In [5]:
cursor = mydb.cursor()

In [8]:
cursor.execute("show databases")

In [9]:
cursor.fetchall()

[('asdf',),
 ('classicmodels',),
 ('information_schema',),
 ('my_work',),
 ('mydatas',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('testyash',),
 ('totorial',),
 ('world',)]

In [10]:
cursor.execute("use testyash")

In [11]:
cursor.execute("show tables")

In [12]:
cursor.fetchall()

[('customer_details',),
 ('employeedetails',),
 ('employeesalary',),
 ('glassdata',),
 ('mytable',),
 ('newtab',),
 ('student_info',),
 ('student_m',),
 ('tab_1',)]

In [ ]:
cursor.execute('create table testyash.EmployeeDetails(EmpId INT(10), FullName VARCHAR(20), ManagerId INT(10), DateOfJoining DATE, City VARCHAR(20))')

In [ ]:
cursor.execute('insert into testyash.EmployeeDetails values(121, "John Snow", 321, 1/31/2019,"Toronto")')
cursor.execute('insert into testyash.EmployeeDetails values(321, "Walter White", 986, 1/30/2020,"California")')
cursor.execute('insert into testyash.EmployeeDetails values(421, "Kuldeep Rana", 876, 27/11/2021,"New Delhi")')

In [9]:
mydb.commit()

In [10]:
cursor.execute(" select * from testyash.EmployeeDetails")

In [11]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

In [13]:
cursor.execute('create table testyash.EmployeeSalary(EmpId INT(10), Project VARCHAR(20), Salary INT(20), Variable INT(20))')

In [ ]:
cursor.execute('insert into testyash.EmployeeSalary values(121, "p1", 8000, 500)')
cursor.execute('insert into testyash.EmployeeSalary values(321, "p2", 10000, 1000)')
cursor.execute('insert into testyash.EmployeeSalary values(421, "p3", 12000, 0)')

In [14]:
mydb.commit()

In [15]:
cursor.execute(" select * from testyash.EmployeeDetails")

In [16]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

In [17]:
cursor.execute(" select * from testyash.EmployeeSalary")

In [18]:
cursor.fetchall()

[(121, 'p1', 8000, 500), (321, 'p2', 10000, 1000), (421, 'p3', 12000, 0)]

### 1. Write an SQL query to fetch the EmpId and FullName of all the employees working under the Manager with id – ‘986’.

In [16]:
cursor.execute("select EmpId, FullName from EmployeeDetails where ManagerId = 986")

In [17]:
cursor.fetchall()

[(321, 'Walter White'), (321, 'Walter White')]

### 2. Write an SQL query to fetch the different projects available from the EmployeeSalary table.

In [9]:
cursor.execute("SELECT DISTINCT(Project) FROM EmployeeSalary")

In [10]:
cursor.fetchall()

[('p1',), ('p2',), ('p3',)]

### 3. Write an SQL query to fetch the count of employees working in project ‘P1’.

In [11]:
cursor.execute("Select count(*) from EmployeeSalary where Project = 'p1'")

In [12]:
cursor.fetchall()

[(1,)]

### 4. Write an SQL query to find the maximum, minimum, and average salary of the employees.

In [25]:
cursor.execute("select max(Salary), min(Salary), avg(Salary) from EmployeeSalary")

In [26]:
cursor.fetchall()

[(12000, 8000, Decimal('10000.0000'))]

### 5. Write an SQL query to find the employee id whose salary lies in the range of 9000 and 15000.

In [27]:
cursor.execute("SELECT EmpId, Salary FROM EmployeeSalary WHERE Salary BETWEEN 9000 AND 15000")

In [28]:
cursor.fetchall()

[(321, 10000), (421, 12000)]

### 6. Write an SQL query to fetch those employees who live in Toronto and work under the manager with ManagerId – 321.

In [29]:
cursor.execute("select EmpId, City, ManagerId from EmployeeDetails where city = 'Toronto' and ManagerId = 321 ")

In [30]:
cursor.fetchall()

[(121, 'Toronto', 321), (121, 'Toronto', 321), (121, 'Toronto', 321)]

### 7. Write an SQL query to fetch all the employees who either live in California or work under a manager with ManagerId – 321.

In [31]:
cursor.execute("select EmpId, City, ManagerId from EmployeeDetails where city = 'California' or ManagerId = 321 ")

In [32]:
cursor.fetchall()

[(121, 'Toronto', 321),
 (121, 'Toronto', 321),
 (321, 'California', 986),
 (121, 'Toronto', 321),
 (321, 'California', 986)]

### 8. Write an SQL query to fetch all those employees who work on Projects other than P1.

In [33]:
cursor.execute("select EmpId FROM EmployeeSalary where not Project = 'p1' ")

In [34]:
cursor.fetchall()

[(321,), (421,)]

### 9. Write an SQL query to display the total salary of each employee adding the Salary with Variable value.

In [35]:
cursor.execute("SELECT EmpId, Salary+Variable as TotalSalary FROM EmployeeSalary")

In [36]:
cursor.fetchall()

[(121, 8500), (321, 11000), (421, 12000)]

### 10. Write an SQL query to fetch the employees whose name begins with any two characters, followed by a text “hn” and ends with any sequence of characters.

In [37]:
cursor.execute("select EmpId, fullName from EmployeeDetails where fullName like '__hn%' ")

In [38]:
cursor.fetchall()

[(121, 'John Snow'), (121, 'John Snow'), (121, 'John Snow')]

### 11. Write an SQL query to fetch all the EmpIds which are present in either of the tables – ‘EmployeeDetails’ and ‘EmployeeSalary’.

In [39]:
cursor.execute("SELECT EmpId FROM EmployeeDetails UNION  SELECT EmpId FROM EmployeeSalary")

In [40]:
cursor.fetchall()

[(121,), (321,), (421,)]

### 12. Write an SQL query to fetch common records between two tables.

In [41]:
 cursor.execute("SELECT * FROM EmployeeSalary WHERE EmpId IN (SELECT EmpId from EmployeeDetails)")

In [42]:
cursor.fetchall()

[(121, 'p1', 8000, 500), (321, 'p2', 10000, 1000), (421, 'p3', 12000, 0)]

In [43]:
cursor.execute("SELECT * FROM EmployeeSalary INNER JOIN EmployeeDetails ON EmployeeSalary.Empid = EmployeeDetails.Empid");

In [44]:
cursor.fetchall()

[(121, 'p1', 8000, 500, 121, 'John Snow', 321, None, 'Toronto'),
 (121, 'p1', 8000, 500, 121, 'John Snow', 321, None, 'Toronto'),
 (321, 'p2', 10000, 1000, 321, 'Walter White', 986, None, 'California'),
 (421, 'p3', 12000, 0, 421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'p1', 8000, 500, 121, 'John Snow', 321, None, 'Toronto'),
 (321, 'p2', 10000, 1000, 321, 'Walter White', 986, None, 'California'),
 (421, 'p3', 12000, 0, 421, 'Kuldeep Rana', 876, None, 'New Delhi')]

### 13. Write an SQL query to fetch records that are present in one table but not in another table.

In [45]:
cursor.execute("SELECT * from EmployeeDetails where Empid not in (select Empid from Employeesalary)")

In [46]:
cursor.fetchall()

[]

In [47]:
cursor.execute("SELECT * FROM EmployeeDetails LEFT JOIN Employeesalary ON EmployeeDetails.Empid = Employeesalary.Empid WHERE Employeesalary.Empid IS NULL")

In [48]:
cursor.fetchall()

[]

### 14. Write an SQL query to fetch the EmpIds that are present in both the tables –  ‘EmployeeDetails’ and ‘EmployeeSalary.

In [49]:
cursor.execute("select * from EmployeeDetails where Empid in (select Empid from Employeesalary)")

In [50]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

### 15. Write an SQL query to fetch the EmpIds that are present in EmployeeDetails but not in EmployeeSalary.

In [51]:
cursor.execute("select Empid from EmployeeDetails where Empid not in ( select Empid from Employeesalary)")

In [52]:
cursor.fetchall()

[]

### 16.Write an SQL query to display both the EmpId and ManagerId together.

In [53]:
cursor.execute("select Empid, Managerid from EmployeeDetails")

In [54]:
cursor.fetchall()

[(121, 321),
 (121, 321),
 (321, 986),
 (421, 876),
 (121, 321),
 (321, 986),
 (421, 876)]

In [55]:
cursor.execute("select Concat(Empid,'-', Managerid) as Emp_Manag from EmployeeDetails")

In [56]:
cursor.fetchall()

[('121-321',),
 ('121-321',),
 ('321-986',),
 ('421-876',),
 ('121-321',),
 ('321-986',),
 ('421-876',)]

### Write an SQL query to display both the EmpId and ManagerId together both in different table

In [63]:
cursor.execute("SELECT E.Empid, M.Managerid FROM EmployeeDetails E INNER JOIN EmployeeDetails M ON E.Empid = M.Managerid")

In [64]:
cursor.fetchall()

[(321, 321), (321, 321), (321, 321), (321, 321), (321, 321), (321, 321)]

### 17. Write a query to fetch only the first name(string before space) from the FullName column of the EmployeeDetails table.1

In [65]:
cursor.execute("SELECT SUBSTRING_INDEX(FullName, ' ',1) AS FirstName FROM EmployeeDetails")

In [66]:
cursor.fetchall()

[('John',),
 ('John',),
 ('Walter',),
 ('Kuldeep',),
 ('John',),
 ('Walter',),
 ('Kuldeep',)]

### 18.Write an SQL query to uppercase the name of the employee and lowercase the city values.

In [67]:
cursor.execute("SELECT Upper(FullName), Lower(city) from EmployeeDetails")

In [68]:
cursor.fetchall()

[('JOHN SNOW', 'toronto'),
 ('JOHN SNOW', 'toronto'),
 ('WALTER WHITE', 'california'),
 ('KULDEEP RANA', 'new delhi'),
 ('JOHN SNOW', 'toronto'),
 ('WALTER WHITE', 'california'),
 ('KULDEEP RANA', 'new delhi')]

### 19. Write an SQL query to find the count of the total occurrences of a particular character – ‘n’ in the FullName field.

In [69]:
cursor.execute("SELECT Fullname, (Length(Fullname) - Length(replace(Fullname, 'n',' '))) as no_of_word from EmployeeDetails")

In [70]:
cursor.fetchall()

[('John Snow', 0),
 ('John Snow', 0),
 ('Walter White', 0),
 ('Kuldeep Rana', 0),
 ('John Snow', 0),
 ('Walter White', 0),
 ('Kuldeep Rana', 0)]

### 20. Fetch all the employees who are not working on any project.

In [71]:
cursor.execute("SELECT Empid from EmployeeSalary where project is Null")

In [72]:
cursor.fetchall()

[]

### 21. Write an SQL query to fetch employee names having a salary greater than or equal to 5000 and less than or equal to 10000.

In [73]:
cursor.execute("SELECT FullName FROM EmployeeDetails WHERE EmpId IN (SELECT EmpId FROM EmployeeSalary WHERE Salary BETWEEN 5000 AND 10000)")

In [74]:
cursor.fetchall()

[('John Snow',),
 ('John Snow',),
 ('Walter White',),
 ('John Snow',),
 ('Walter White',)]

In [75]:
cursor.execute("SELECT e.FullName,s.Salary FROM EmployeeDetails e INNER JOIN EmployeeSalary s ON e.EmpId = s.EmpId WHERE Salary >= 5000 AND Salary <= 10000")

In [76]:
cursor.fetchall()

[('John Snow', 8000),
 ('John Snow', 8000),
 ('Walter White', 10000),
 ('John Snow', 8000),
 ('Walter White', 10000)]

### 22.Write an SQL query to find the current date-time.

In [77]:
cursor.execute("SELECT NOW()")

In [78]:
cursor.fetchall()

[(datetime.datetime(2023, 10, 6, 15, 24, 55),)]

### 23.Write an SQL query to fetch all the Employee details from the EmployeeDetails table who joined in the Year 2020

In [79]:
cursor.execute("SELECT * FROM EmployeeDetails WHERE YEAR(DateOfJoining) = '2020'")

In [80]:
cursor.fetchall()

[]

In [81]:
cursor.execute("SELECT * From EmployeeDetails WHERE DateofJoining between '2020/01/01' AND '2020/12/31'")

In [82]:
cursor.fetchall()

[]

### 24.Write an SQL query to fetch all employee records from the EmployeeDetails table who have a salary record in the EmployeeSalary table

In [83]:
cursor.execute("SELECT * from EmployeeDetails as E INNER Join EmployeeSalary as S ON E.Empid = S.Empid")

In [84]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto', 121, 'p1', 8000, 500),
 (121, 'John Snow', 321, None, 'Toronto', 121, 'p1', 8000, 500),
 (321, 'Walter White', 986, None, 'California', 321, 'p2', 10000, 1000),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi', 421, 'p3', 12000, 0),
 (121, 'John Snow', 321, None, 'Toronto', 121, 'p1', 8000, 500),
 (321, 'Walter White', 986, None, 'California', 321, 'p2', 10000, 1000),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi', 421, 'p3', 12000, 0)]

### 25. Write an SQL query to fetch the project-wise count of employees sorted by project’s count in descending order.

In [85]:
cursor.execute("SELECT project, count(Empid) as Empcount from EmployeeSalary Group BY project Order BY Empcount Desc")

In [86]:
cursor.fetchall()

[('p1', 1), ('p2', 1), ('p3', 1)]

### 26.Write a query to fetch employee names and salary records. Display the employee details even if the salary record is not present for the employee.

In [87]:
cursor.execute("SELECT E.FullName, S.Salary FROM EmployeeDetails E LEFT JOIN EmployeeSalary S ON E.EmpId = S.EmpId")

In [88]:
cursor.fetchall()

[('John Snow', 8000),
 ('John Snow', 8000),
 ('Walter White', 10000),
 ('Kuldeep Rana', 12000),
 ('John Snow', 8000),
 ('Walter White', 10000),
 ('Kuldeep Rana', 12000)]

In [89]:
cursor.execute("SELECT E.FullName, IFNULL(S.Salary, 'No salary record') AS Salary FROM EmployeeDetails E LEFT JOIN EmployeeSalary S ON E.EmpId = S.EmpId")

In [90]:
cursor.fetchall()

[('John Snow', '8000'),
 ('John Snow', '8000'),
 ('Walter White', '10000'),
 ('Kuldeep Rana', '12000'),
 ('John Snow', '8000'),
 ('Walter White', '10000'),
 ('Kuldeep Rana', '12000')]

### 27. Write an SQL query to fetch all the Employees who are also managers from the EmployeeDetails table.

In [91]:
cursor.execute("Select Distinct (E.FullName), M.Managerid from EmployeeDetails as E Inner Join EmployeeDetails M ON E.Empid = M.Managerid")

In [92]:
cursor.fetchall()

[('Walter White', 321)]

### 28.Write an SQL query to fetch duplicate records from EmployeeDetails (without considering the primary key – EmpId).

In [93]:
cursor.execute("Select FullName, ManagerId, DateOfJoining, City, Count(*) from EmployeeDetails Group By FullName, ManagerId, DateOfJoining, City having Count(*) > 1")

In [94]:
cursor.fetchall()

[('John Snow', 321, None, 'Toronto', 3),
 ('Walter White', 986, None, 'California', 2),
 ('Kuldeep Rana', 876, None, 'New Delhi', 2)]

In [95]:
cursor.execute("Select FullName, count(FullName) as Duplicate_count from EmployeeDetails Group By FullName Having Count(FullName) >1")

In [96]:
cursor.fetchall()

[('John Snow', 3), ('Walter White', 2), ('Kuldeep Rana', 2)]

In [97]:
cursor.execute("Select * from EmployeeDetails Where FullName IN(Select FullName from EmployeeDetails Group By FullName Having Count(FullName) >1)")

In [98]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

### Write an SQL query to remove duplicates from  EmployeeDetails table

In [99]:
cursor.execute("DELETE FROM EmployeeDetails
WHERE EmpId NOT IN (
SELECT MIN(EmpId)
FROM EmployeeDetails
GROUP BY EmployeeName
HAVING COUNT(*) > 1")

SyntaxError: unterminated string literal (detected at line 1) (3348261467.py, line 1)

### 29.Write an SQL query to remove duplicates from a table without using a temporary table.

In [100]:
cursor.execute("Delete E1 from EmployeeDetails E1 INNER JOIN EmployeeDetails E2 ON E1.FullName = E2.FullName 
AND E1.ManagerId = E2.ManagerId
AND E1.DateOfJoining = E2.DateOfJoining
AND E1.City = E2.City Where E1.Empid > E2.empid")

SyntaxError: unterminated string literal (detected at line 1) (1892176415.py, line 1)

In [101]:
cursor.fetchall()

[]

### Write an SQL query to remove duplicates from a table using a temporary table

In [102]:
Cursor.execute("CREATE TABLE TempTable AS SELECT DISTINCT * FROM YourTableName")

NameError: name 'Cursor' is not defined

In [103]:
cursor.execute("ALTER TABLE TempTable RENAME TO YourTableName")

ProgrammingError: 1146 (42S02): Table 'testyash.temptable' doesn't exist

### 30.Write an SQL query to fetch only odd rows from the table.

In [104]:
cursor.execute("SELECT * FROM EmployeeDetails WHERE MOD (EmpId, 2) <> 0")

In [105]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

In [106]:
cursor.execute("SELECT * FROM EmployeeDetails WHERE EmpId % 2 = 1")

In [107]:
cursor.fetchall()

[(121, 'John Snow', 321, None, 'Toronto'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi'),
 (121, 'John Snow', 321, None, 'Toronto'),
 (321, 'Walter White', 986, None, 'California'),
 (421, 'Kuldeep Rana', 876, None, 'New Delhi')]

### 31.Write an SQL query to fetch only even rows from the table.

In [108]:
cursor.execute("SELECT * FROM EmployeeDetails WHERE MOD (EmpId, 2) = 0")

In [109]:
cursor.fetchall()

[]

In [110]:
cursor.execute("SELECT * FROM EmployeeDetails WHERE EmpId % 2 = 0")

In [111]:
cursor.fetchall()

[]

### 32.Write an SQL query to create a new table with data and structure copied from another table.

In [112]:
cursor.execute("Create Table Newtab Select * from EmployeeSalary")

ProgrammingError: 1050 (42S01): Table 'Newtab' already exists

In [113]:
cursor.fetchall()

[]

### 33.Write an SQL query to create an empty table with the same structure as some other table.

In [114]:
cursor.execute("Create Table tab_1 Select * from EmployeeSalary where 1=0")

ProgrammingError: 1050 (42S01): Table 'tab_1' already exists

In [115]:
cursor.fetchall()

[]

In [116]:
cursor.execute("CREATE TABLE NewTableName LIKE ExistingTableName")

ProgrammingError: 1146 (42S02): Table 'testyash.existingtablename' doesn't exist

In [117]:
cursor.fetchall()

[]

In [118]:
cursor.execute("show tables")

In [119]:
cursor.fetchall()

[('customer_details',),
 ('employeedetails',),
 ('employeesalary',),
 ('glassdata',),
 ('mytable',),
 ('newtab',),
 ('tab_1',)]

### 34.Write an SQL query to fetch top n records

In [4]:
cursor.execute("SELECT * FROM EmployeeSalary ORDER BY Salary DESC LIMIT 10")

NameError: name 'cursor' is not defined

In [121]:
cursor.fetchall()

[(421, 'p3', 12000, 0), (321, 'p2', 10000, 1000), (121, 'p1', 8000, 500)]

### 35.Write an SQL query to find the nth highest salary from a table.

In [122]:
cursor.execute("SELECT DISTINCT Salary FROM EmployeeSalary ORDER BY Salary DESC LIMIT 2, 1")

In [123]:
cursor.fetchall()

[(8000,)]

### 36.Write SQL query to find the 3rd highest salary from a table without using the TOP/limit keyword.

In [124]:
cursor.execute("SELECT Salary From EmployeeSalary Emp1 WHERE 3=(SELECT Count(DISTINCT (Emp2.Salary)) from EmployeeSalary Emp2 WHERE Emp2.Salary >= Emp1.Salary)")

In [125]:
cursor.fetchall()

[(8000,)]

In [127]:
cursor.execute('create table testyash.student_M(roll_no INT(10), Science int(20), Maths INT(10), English INT(10))')

In [129]:
cursor.execute('insert into testyash.student_M values(1,30,55,50)')
cursor.execute('insert into testyash.student_M values(2,65,45,45)')
cursor.execute('insert into testyash.student_M values(3,48,65,63)')
cursor.execute('insert into testyash.student_M values(4,56,52,75)')
cursor.execute('insert into testyash.student_M values(5,74,45,85)')
cursor.execute('insert into testyash.student_M values(6,25,35,95)')
cursor.execute('insert into testyash.student_M values(7,33,78,64)')
cursor.execute('insert into testyash.student_M values(8,88,66,65)')
cursor.execute('insert into testyash.student_M values(9,44,95,52)')
cursor.execute('insert into testyash.student_M values(10,64,47,45)')

In [131]:
mydb.commit()

In [132]:
cursor.execute("select * from testyash.student_M")

In [133]:
cursor.fetchall()

[(1, 30, 55, 50),
 (2, 65, 45, 45),
 (3, 48, 65, 63),
 (4, 56, 52, 75),
 (5, 74, 45, 85),
 (6, 25, 35, 95),
 (7, 33, 78, 64),
 (8, 88, 66, 65),
 (9, 44, 95, 52),
 (10, 64, 47, 45)]

In [144]:
cursor.execute('create table testyash.student_info(roll_no INT(10), stu_name varchar(20), city varchar(20))')

In [145]:
cursor.execute('INSERT INTO testyash.student_info VALUES (1, "raj", "delhi")')
cursor.execute('INSERT INTO testyash.student_info VALUES (2, "rahul", "delhi")')
cursor.execute('INSERT INTO testyash.student_info VALUES (3, "jay", "kolkata")')
cursor.execute('INSERT INTO testyash.student_info VALUES (4, "sonam", "indore")')
cursor.execute('INSERT INTO testyash.student_info VALUES (5, "kunal", "hydrabad")')
cursor.execute('INSERT INTO testyash.student_info VALUES (6, "ram", "delhi")')
cursor.execute('INSERT INTO testyash.student_info VALUES (7, "rani", "patna")')
cursor.execute('INSERT INTO testyash.student_info VALUES (8, "veeru", "ujjain")')
cursor.execute('INSERT INTO testyash.student_info VALUES (9, "jivan", "reewa")')
cursor.execute('INSERT INTO testyash.student_info VALUES (10, "abhi", "goa")')

In [146]:
mydb.commit()

In [147]:
cursor.execute("select * from testyash.student_info")

In [148]:
cursor.fetchall()

[(1, 'raj', 'delhi'),
 (2, 'rahul', 'delhi'),
 (3, 'jay', 'kolkata'),
 (4, 'sonam', 'indore'),
 (5, 'kunal', 'hydrabad'),
 (6, 'ram', 'delhi'),
 (7, 'rani', 'patna'),
 (8, 'veeru', 'ujjain'),
 (9, 'jivan', 'reewa'),
 (10, 'abhi', 'goa')]

 ### select student who live in delhi

In [ ]:
select * from student_M where roll_no =
(select roll_no from student_info where city = 'delhi');

In [158]:
cursor.execute("SELECT * FROM student_M WHERE roll_no IN (SELECT roll_no FROM student_info WHERE city = 'delhi')")

In [159]:
cursor.fetchall()

[(1, 30, 55, 50), (2, 65, 45, 45), (6, 25, 35, 95)]

### 2nd Highest salary using corelated sub query

In [41]:
cursor.execute("SELECT DISTINCT salary From EmployeeSalary Emp1 WHERE 2=(SELECT Count(DISTINCT Salary) from EmployeeSalary Emp2 WHERE Emp1.Salary >= Emp2.Salary)")

In [42]:
cursor.fetchall()

[(10000,)]

### Nth highest salary

In [82]:
cursor.execute("SELECT DISTINCT salary FROM EmployeeSalary Emp1 WHERE (1)= (SELECT COUNT(DISTINCT salary)FROM EmployeeSalary Emp2 WHERE Emp1.salary <= Emp2.salary)")

In [83]:
cursor.fetchall()

[(12000,)]

### 3th Highest salary using corelated sub query

In [101]:
cursor.execute("SELECT DISTINCT salary From EmployeeSalary Emp1 WHERE 3=(SELECT Count(DISTINCT Salary) from EmployeeSalary Emp2 WHERE Emp1.Salary >= Emp2.Salary)")

In [102]:
cursor.fetchall()

[(12000,)]

### 2nd highest salary using Sub-query

In [103]:
cursor.execute("select max(salary) from EmployeeSalary where salary <(select max(salary) from EmployeeSalary)")

In [104]:
cursor.fetchall()

[(10000,)]

### 3rd highest salary

In [105]:
cursor.execute("Select max(salary) from EmployeeSalary WHERE Salary <(Select max(salary) from EmployeeSalary WHERE Salary <(Select max(salary) from EmployeeSalary))")

In [106]:
cursor.fetchall()

[(8000,)]

### Write a query to get the monthly sales amount for the last 12 months.

In [14]:
cursor.execute("SELECT DATE_FORMAT(date, '%Y-%m') AS month,SUM(amount) AS monthly_sales FROM EmployeeSalary WHERE date >= DATE_SUB(CURRENT_DATE, INTERVAL 12 MONTH) GROUP BY DATE_FORMAT(date, '%Y-%m') ORDER BY month")

In [15]:
#cursor.execute("SELECT MONTH(sale_date) AS month, YEAR(sale_date) AS year, SUM(amount) AS monthly_sales
FROM sales 
WHERE sale_date BETWEEN DATE_SUB(NOW(), INTERVAL 12 MONTH) AND NOW() 
GROUP BY YEAR(sale_date), MONTH(sale_date) 
ORDER BY YEAR(sale_date) DESC, MONTH(sale_date) DESC")

SyntaxError: unterminated string literal (detected at line 5) (401804691.py, line 5)

### Find the employees who earn more than the average salary in their respective departments.

In [25]:
cursor.execute("SELECT e1.id, e1.name, e1.salary, e1.department_id 
FROM employees e1 
JOIN (SELECT department_id, AVG(salary) AS avg_salary 
      FROM employees 
      GROUP BY department_id) e2 
ON e1.department_id = e2.department_id 
WHERE e1.salary > e2.avg_salary")

SyntaxError: unterminated string literal (detected at line 1) (839132043.py, line 1)

### Retrieve all pairs of students who have the same scores

In [26]:
cursor.execute("SELECT s1.student_name AS student1, s2.student_name AS student2, s1.score
FROM students s1
JOIN students s2 ON s1.score = s2.score
WHERE s1.student_id < s2.student_id")

SyntaxError: unterminated string literal (detected at line 1) (1438370644.py, line 1)

### Write a query to retrieve the last 7 days' records, excluding weekends.

In [27]:
cursor.execute("SELECT * 
FROM Empdetails 
WHERE date_column BETWEEN DATE_SUB(CURDATE(), INTERVAL 7 DAY) AND CURDATE() 
AND DAYOFWEEK(date_column) NOT IN (1,7)")

SyntaxError: unterminated string literal (detected at line 1) (4230531693.py, line 1)

### Find the employees who have the same job roles in different departments.

In [28]:
cursor.execute("SELECT e1.employee_id, e1.employee_name, e1.job_role, e1.department_id, e2.department_id AS other_department_id
FROM employees e1
JOIN employees e2 ON e1.job_role = e2.job_role
WHERE e1.department_id <> e2.department_id)")

SyntaxError: unterminated string literal (detected at line 1) (4071081143.py, line 1)

### Retrieve the total sales amount, but replace null values with zeros

In [34]:
cursor.execute("SELECT IFNULL(SUM(sales_amount), 0) AS total_sales FROM EmployeeSalary")

In [38]:
cursor.fetchall()

[(Decimal('30000'),)]

### How would you retrieve the name and salary of the top 3 earning employees?

In [39]:
cursor.execute("SELECT employee_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 3")

SyntaxError: unterminated string literal (detected at line 1) (3648275317.py, line 1)

In [40]:
cursor.execute("SELECT name, salary, dense_rank() OVER (ORDER BY salary DESC) AS top_rank
FROM emply
WHERE dense_rank() <= 3
ORDER BY salary DESC")

SyntaxError: unterminated string literal (detected at line 1) (630202736.py, line 1)

### Find employees who earn above the average salary of their department and their department's average salary is above the company's average

In [41]:
cursor.execute("Select e1.name, e1.salary from employee e1 
               Where e1.salary > ("Select avg(salary) from employee 
               Where  department-id = e1.department-id
               )
               AND(
               Select Avg(salary) from employee
               where department-id = e1.department-id
               )>(
               Select Avg(salary) from employee")

SyntaxError: unterminated string literal (detected at line 1) (3215364937.py, line 1)

### Find the second highest departmental average salary.

In [42]:
cursor.execute("SELECT e1.department_id, COUNT(e1.employee_id) AS department_employee_count
FROM employees e1
LEFT JOIN employees e2 ON e1.department_id = e2.department_id AND e1.employee_id <> e2.employee_id
GROUP BY e1.department_id
HAVING COUNT(e1.employee_id) > AVG(COUNT(e2.employee_id)")

SyntaxError: unterminated string literal (detected at line 1) (589493334.py, line 1)

### Retrieve the highest earning employee from each department

In [44]:
cursor.execute("SELECT e1.emp_id, e1.department_id, e1.emp_name, e1.salary from employee e1
               where e1.salary = (Select max(e2.salary) from employee e2)
               where e2.department_id = e1.department_id")

SyntaxError: unterminated string literal (detected at line 1) (597133362.py, line 1)

### Which departments have the same average salary?

In [45]:
cursor.execute("SELECT e1.department_id, e2.department_id AS other_department_id, AVG(e1.salary) AS avg_salary
FROM employees e1
JOIN employees e2 ON e1.department_id < e2.department_id
GROUP BY e1.department_id, e2.department_id
HAVING AVG(e1.salary) = AVG(e2.salary)")

SyntaxError: unterminated string literal (detected at line 1) (3089591135.py, line 1)

### Determine if any department's average salary is higher than the maximum salary in another department.

In [46]:
cursor.execute("SELECT
    d1.department_id AS department1,
    d2.department_id AS department2
FROM
    (SELECT department_id, AVG(salary) AS avg_salary FROM employees GROUP BY department_id) AS d1
JOIN
    (SELECT department_id, MAX(salary) AS max_salary FROM employees GROUP BY department_id) AS d2
ON
    d1.department_id <> d2.department_id
WHERE
    d1.avg_salary > d2.max_salary")

SyntaxError: unterminated string literal (detected at line 1) (3129616510.py, line 1)